app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "created_at", "updated_at", "user_id", "location", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Coffee "], ["created_at", "2018-02-16 21:25:40.858506"], ["updated_at", "2018-02-16 21:25:40.858506"], ["user_id", 4], ["location", "green line cafe"], ["creator_id", 0]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "joiner" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["joiner", "patrickcolleton@gmail.com"], ["updated_at", "2018-02-19 19:18:02.391758"], ["id", 33]]